RearWingSimpleFoam/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    sym
    {
        type            symmetry;
    }

    RW_MP
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    RW_MP-FINE
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    RW_END
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    RW_END-FINE
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
